[BalanceDefs.M_MothersDayGift MissionDefinition]
MissionDescription="You've found a Mother's Day present. Unfortunately, it can only be opened with the fist-print of the man who bought it. If you wanna see what's inside the box, you'll have to track down Taggart's fist."
MissionSummary="Unlock Taggart's Mother's Day present."
TeaserText="WHAT'S IN THE BOOOOOOX?!"
